configs/runs/relational_reasoning/blackboard_game/astra_task003_no_control_q12_deepinfra_rho3_stress_c390/study.yaml
study: {name: astra_task003_no_control_q12_deepinfra_rho3_stress_c390}
configs: [no_control_stress.yaml]
execution:
  mode: auto
  cells_per_shard: 1
  target_rpm: 1000
  assumed_latency_seconds: 24.0
  max_active_nodes: 3
  throttle: 3
  cpus_per_task: 16
  memory: 32G
  time_limit: "36:00:00"
  partition: main
  qos: normal
  results_root: /shared/home/cesar/work/results/studies/astra_task003_no_control_q12_deepinfra_rho3_stress_c390
  require_results_under: /shared/home/cesar/work/results
  provider_load_control: {mode: shared_adaptive, initial_concurrency: 390, minimum_concurrency: 25, maximum_concurrency: 390, target_rpm: 1000, lease_seconds: 90, heartbeat_seconds: 20, retry_max_elapsed_seconds: 300}
analysis: {recipe: analysis.yaml}